---
kind: type
id: T:Autodesk.Revit.DB.Electrical.AnalyticalBusData
source: html/de5843fd-39a2-6a78-7c67-b9a592b404bb.htm
---
# Autodesk.Revit.DB.Electrical.AnalyticalBusData

Represents the data and parameters of analytical bus node.

## Syntax (C#)
```csharp
public class AnalyticalBusData : AnalyticalDistributionNodePropertyData
```